Repository: khasanyusupkhujaev/uzgn
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uz

source: Home
uz: Bosh sahifa

source: Members
uz: A'zolar

source: Companies
uz: Kompaniyalar

source: Contact
uz: Aloqa

source: Login
uz: Kirish

source: Register
uz: Ro'yxatdan o'tish

source: Dashboard
uz: Boshqaruv paneli

source: Edit Profile
uz: Profilni tahrirlash

source: Logout
uz: Chiqish

source: Top Universities
uz: Top Universitetlar

source: Youth Club Community
uz: Yoshlar Klubi Jamiyati

source: Connect with talented youth from top universities
uz: Yuqori universitetlardan kelgan iqtidorli yoshlar bilan bog'laning

source: Join Our Community
uz: Jamiyatimizga qo'shiling

source: View Members
uz: A'zolarni ko'rish

source: View Companies
uz: Kompaniyalarni ko'rish

source: Create Account
uz: Hisob yaratish

source: Member Registration
uz: A'zo ro'yxatdan o'tish

source: Company Registration
uz: Kompaniya ro'yxatdan o'tish

source: Email
uz: Elektron pochta

source: Password
uz: Parol

source: Confirm Password
uz: Parolni tasdiqlash

source: Full Name
uz: To'liq ism

source: University Name
uz: Universitet nomi

source: University Country
uz: Universitet mamlakat

source: Major
uz: Mutaxassislik

source: Start Date
uz: Boshlanish sanasi

source: End Date
uz: Tugash sanasi

source: I am a current student
uz: Men hozirgi talabaman

source: Company
uz: Kompaniya

source: Position
uz: Lavozim

source: Bio
uz: Biografiya

source: Profile Photo
uz: Profil rasmi

source: Company Name
uz: Kompaniya nomi

source: Country
uz: Mamlakat

source: Industry
uz: Soha

source: Company Logo
uz: Kompaniya logotipi

source: Contact Us
uz: Biz bilan bog'laning

source: Get in touch with our community
uz: Jamiyatimiz bilan bog'laning

source: Contact Information
uz: Aloqa ma'lumotlari

source: Our Team
uz: Jamoamiz

source: Founder
uz: Asoschisi

source: Get Involved
uz: Qatnashing

source: Ready to join our community? Whether you're a student, graduate, or company, we'd love to have you as part of our network.
uz: Jamiyatimizga qo'shilishga tayyormisiz? Talaba, bitiruvchi yoki kompaniya bo'lsangiz ham, sizni tarmog'imizning bir qismi sifatida ko'rishni istaymiz.

source: Language
uz: Til

source: English
uz: Ingliz tili

source: O'zbek
uz: O'zbek tili

source: Welcome to Youth Club
uz: Yoshlar Klubiga xush kelibsiz

source: A community of talented youth from top universities around the world
uz: Dunyoning yuqori universitetlaridan kelgan iqtidorli yoshlar jamiyati

source: Connect, collaborate, and grow together with like-minded individuals who are making a difference in their fields.
uz: O'z sohalarida farq qilayotgan o'xshash fikrli odamlar bilan bog'laning, hamkorlik qiling va birga o'sing.

source: Sign In
uz: Kirish

source: Go to Dashboard
uz: Boshqaruv paneliga o'tish

source: Our Members
uz: Bizning a'zolar

source: Discover talented individuals from top universities
uz: Yuqori universitetlardan kelgan iqtidorli shaxslarni kashf eting

source: View Profile
uz: Profilni ko'rish

source: No Members Yet
uz: Hali a'zolar yo'q

source: No members have registered yet. Check back later!
uz: Hali hech kim ro'yxatdan o'tmagan. Keyinroq qaytib keling!

source: Our Partner Companies
uz: Bizning hamkor kompaniyalar

source: Discover the innovative companies we work with
uz: Biz bilan ishlayotgan innovatsion kompaniyalarni kashf eting

source: View Details
uz: Tafsilotlarni ko'rish

source: No Companies Yet
uz: Hali kompaniyalar yo'q

source: No companies have registered yet. Check back later!
uz: Hali hech qanday kompaniya ro'yxatdan o'tmagan. Keyinroq qaytib keling!

source: Sign In to Your Account
uz: Hisobingizga kiring

source: Enter your credentials to access your account
uz: Hisobingizga kirish uchun ma'lumotlaringizni kiriting

source: Remember Me
uz: Meni eslab qol

source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: Forgot your password?
uz: Parolingizni unutdingizmi?

source: Choose your registration type
uz: Ro'yxatdan o'tish turini tanlang

source: I am a student or graduate
uz: Men talaba yoki bitiruvchiman

source: I represent a company
uz: Men kompaniyani vakillik qilaman

source: Sections marked with * are mandatory, other sections are highly beneficial to fill
uz: * belgisi qo'yilgan bo'limlar majburiy, boshqa bo'limlarni to'ldirish juda foydali

source: When did you start university?
uz: Universitetga qachon kirdingiz?

source: When did you graduate?
uz: Qachon bitirdingiz?

source: Upload your profile photo (optional)
uz: Profil rasmingizni yuklang (ixtiyoriy)

source: Upload your company logo (optional)
uz: Kompaniya logotipingizni yuklang (ixtiyoriy)

source: Create Member Account
uz: A'zo hisobini yaratish

source: Create Company Account
uz: Kompaniya hisobini yaratish

source: Already have an account?
uz: Allaqachon hisobingiz bormi?

source: Welcome back
uz: Qaytganingiz bilan

source: Your Profile
uz: Sizning profilingiz

source: Edit your profile information
uz: Profil ma'lumotlaringizni tahrirlang

source: View All Members
uz: Barcha a'zolarni ko'rish

source: Browse our community members
uz: Jamiyat a'zolarimizni ko'rib chiqing

source: View All Companies
uz: Barcha kompaniyalarni ko'rish

source: Browse our partner companies
uz: Hamkor kompaniyalarimizni ko'rib chiqing

source: Welcome Back
uz: Qaytganingiz bilan

source: Sign in to your account
uz: Hisobingizga kiring

source: Email Address
uz: Elektron pochta manzili

source: Join our community
uz: Jamiyatimizga qo'shiling

source: Quick Stats
uz: Tezkor statistikalar

source: Community
uz: Jamiyat

source: Connect with other members and explore opportunities.
uz: Boshqa a'zolar bilan bog'laning va imkoniyatlarni o'rganing.

source: Be the first to join our community!
uz: Jamiyatimizga qo'shilgan birinchi bo'ling!

source: Join Now
uz: Hozir qo'shiling

source: Members from prestigious universities worldwide, bringing diverse perspectives and expertise.
uz: Dunyoning nufuzli universitetlaridan kelgan a'zolar, turli xil nuqtai nazarlar va tajriba bilan.

source: Professional Network
uz: Professional tarmoq

source: Connect with professionals across various industries and build meaningful relationships.
uz: Turli sohalardagi mutaxassislar bilan bog'laning va mazmunli munosabatlarni quring.

source: Collaboration
uz: Hamkorlik

source: Work together on projects, share knowledge, and create opportunities for growth.
uz: Loyihalar bo'yicha birga ishlang, bilim almashing va o'sish imkoniyatlarini yarating.

source: Why Join Youth Club?
uz: Nima uchun Youth Club'ga qo'shilish kerak?

source: Access to a global network of talented individuals
uz: Dunyodagi iqtidorli shaxslar global tarmogiga kirish

source: Professional development opportunities
uz: Professional rivojlanish imkoniyatlari

source: Mentorship and career guidance
uz: Mentorlik va martaba yo'nalishi

source: Collaborative project opportunities
uz: Hamkorlik loyihalari imkoniyatlari

source: Knowledge sharing and learning
uz: Bilim almashish va o'rganish

source: Industry insights and trends
uz: Soha tahlillari va tendentsiyalari

source: Networking events and meetups
uz: Tarmoq tadbirlari va uchrashuvlar

source: Personal and professional growth
uz: Shaxsiy va professional o'sish

source: I am a...
uz: Men...

source: I am a student or graduate from a university
uz: Men universitet talabasi yoki bitiruvchisiman

source: I represent a company or organization
uz: Men kompaniya yoki tashkilotni vakillik qilaman

source: Sign in here
uz: Bu yerda kiring

source: Back
uz: Orqaga

source: Sections marked with * are mandatory, other sections are highly beneficial to fill.
uz: * belgisi qo'yilgan bo'limlar majburiy, boshqa bo'limlarni to'ldirish juda foydali.

source: Registering as:
uz: Ro'yxatdan o'tish turi:

source: Member
uz: A'zo

source: Basic Information
uz: Asosiy ma'lumotlar

source: Education Information
uz: Ta'lim ma'lumotlari

source: Select month and year
uz: Oy va yilni tanlang

source: Employment Status
uz: Ishlash holati

source: Additional Information
uz: Qo'shimcha ma'lumotlar

source: Tell us about yourself...
uz: O'zingiz haqingizda gapiring...

source: Optional: Upload a profile photo (PNG, JPG, JPEG, GIF)
uz: Ixtiyoriy: Profil rasmingizni yuklang (PNG, JPG, JPEG, GIF)

source: Company Information
uz: Kompaniya ma'lumotlari

source: e.g., Technology, Finance, Healthcare, etc.
uz: masalan, Texnologiya, Moliya, Sog'liqni saqlash va boshqalar

source: Forgot Password
uz: Parolni unutdingizmi

source: Enter your email address and we'll send you a link to reset your password.
uz: Elektron pochta manzilingizni kiriting va biz sizga parolni tiklash uchun havola yuboramiz.

source: Send Reset Link
uz: Tiklash havolasini yuborish

source: Back to Login
uz: Kirishga qaytish

source: Phone Number
uz: Telefon raqami

source: Upload New Photo
uz: Yangi rasm yuklash

source: Upload New Logo
uz: Yangi logotip yuklash

source: PNG, JPG, JPEG, GIF (max 16MB)
uz: PNG, JPG, JPEG, GIF (maksimal 16MB)

source: Current Photo
uz: Joriy rasm

source: Social Media & Links
uz: Ijtimoiy tarmoqlar va havolalar

source: Add Social Media
uz: Ijtimoiy tarmoq qo'shish

source: Personal Website
uz: Shaxsiy veb-sayt

source: CV/Resume
uz: CV/Rezyume

source: Upload CV/Resume
uz: CV/Rezyume yuklash

source: PDF, DOC, DOCX (max 16MB)
uz: PDF, DOC, DOCX (maksimal 16MB)

source: Current CV
uz: Joriy CV

source: Download Current CV
uz: Joriy CV ni yuklab olish

source: Back to Dashboard
uz: Boshqaruv paneliga qaytish

source: Save Changes
uz: O'zgarishlarni saqlash

source: Meet Our Community
uz: Jamiyatimiz bilan tanishing

source: Discover talented individuals from top universities around the world
uz: Dunyoning yuqori universitetlaridan kelgan iqtidorli shaxslarni kashf eting

source: VISIBILITY
uz: KO'RINISHLIK

source: CONNECTIONS
uz: ALOQALAR

source: GROWTH
uz: O'SISH

source: Business moves at the speed of community.
uz: Biznes jamiyat tezligida harakat qiladi.

source: For over a decade, Youth Club Community has pioneered and grown to become the global leader for professional communities of talented youth from top universities.
uz: O'n yildan ortiq vaqt davomida Youth Club Community dunyoning yuqori universitetlaridan kelgan iqtidorli yoshlar uchun professional jamiyatlar bo'yicha global yetakchiga aylanish uchun kashshof bo'ldi va o'sdi.

source: Let's Do Business
uz: Biznes qilaylik

source: Our members are industry leaders who drive business forward.
uz: Bizning a'zolarimiz biznesni oldinga siljitadigan soha yetakchilaridir.

source: ABOUT YOUTH CLUB COMMUNITY
uz: YOUTH CLUB COMMUNITY HAQIDA

source: Builders of bespoke professional communities.
uz: Maxsus professional jamiyatlar quruvchilari.

source: We partner with, and are trusted by, the most demanding and discerning business networks in the world. We provide a digital business model, tools, and access to trusted peers, mentors and other meaningful relationships that elevate a member experience into time well spent.
uz: Biz dunyodagi eng talabchan va farosatli biznes tarmoqlari bilan hamkorlik qilamiz va ular tomonidan ishonchga sazovor bo'lamiz. Biz raqamli biznes modeli, vositalar va ishonchli tengdoshlar, mentorlar va a'zo tajribasini vaqtni yaxshi sarflashga olib keladigan boshqa mazmunli munosabatlarga kirish imkonini beramiz.

source: More About Us
uz: Biz haqimizda ko'proq

source: Members from prestigious universities worldwide
uz: Dunyoning nufuzli universitetlaridan a'zolar

source: Connect with industry leaders
uz: Soha yetakchilari bilan bog'laning

source: Growth
uz: O'sish

source: Accelerate your career
uz: Karyerangizni tezlashtiring

source: OUR MEMBERS
uz: BIZNING A'ZOLAR

source: Ambitious executives and entrepreneurs who drive business forward.
uz: Biznesni oldinga siljitadigan ambitsiyali rahbarlar va tadbirkorlar.

source: We understand the needs of motivated business leaders and executives who want to spend their time in purposeful and meaningful ways. Our members are busy and accomplished professional leaders who:
uz: Biz vaqtlarini maqsadli va mazmunli tarzda sarflashni istaydigan motivatsiyalangan biznes rahbarlari va boshqaruvchilarining ehtiyojlarini tushunamiz. Bizning a'zolarimiz band va muvaffaqiyatli professional rahbarlar:

source: Have hyper-specific goals
uz: Juda aniq maqsadlarga ega

source: and needs that keep them engaged.
uz: va ularni jalb qiladigan ehtiyojlar.

source: Want to be surrounded by like-minded peers
uz: O'xshash fikrli tengdoshlar bilan o'ralishni xohlashadi

source: both accomplished and aspirational.
uz: ham muvaffaqiyatli, ham orzu qiluvchi.

source: Want increased visibility
uz: Ko'proq ko'rinishni xohlashadi

source: for their ideas, insights, and influence within their industry.
uz: o'z g'oyalari, tushunchalari va sohadagi ta'siri uchun.

source: Crave authentic connection
uz: Haqiqiy aloqani istashadi

source: and access to meaningful relationships to grow their businesses.
uz: va bizneslarini o'shirish uchun mazmunli munosabatlardan foydalanish.

source: Want immediate support
uz: Darhol qo'llab-quvvatlashni xohlashadi

source: from trusted peers and mentors to stay ahead of the game.
uz: o'yinda oldinda qolish uchun ishonchli tengdoshlar va mentorlardan.

source: Seek access to valuable benefits
uz: Qimmatli imtiyozlarga kirishni qidirishadi

source: and services that have real impact on their time and business.
uz: va ularning vaqti va biznesiga haqiqiy ta'sir ko'rsatadigan xizmatlar.

source: More About Our Member Base
uz: A'zolarimiz bazasi haqida ko'proq

source: A DISTINCT ADVANTAGE
uz: AJRALIB TUROVCHI AFZALLIK

source: The business of community for a digital professional world.
uz: Raqamli professional dunyo uchun jamiyat biznesi.

source: In a world where community has become a bit of a buzzword, your audience has infinite networking options to choose from—which means you need a differentiated solution.
uz: Jamiyat biroz moda so'zga aylangan dunyoda, auditoriyangiz tanlash uchun cheksiz tarmoq variantlariga ega—bu sizga farqlanuvchi yechim kerakligini anglatadi.

source: We build and manage bespoke professional communities of all shapes and sizes. We know the business of community for a digital-first professional world, because we pioneered, and even literally, wrote the book on it.
uz: Biz har xil shakl va o'lchamdagi maxsus professional jamiyatlarni qurish va boshqarish. Biz raqamli-birinchi professional dunyo uchun jamiyat biznesini bilamiz, chunki biz buni kashshof qildik va hatto so'zma-so'z kitob yozdik.

source: See How We Do It
uz: Buni qanday qilishimizni ko'ring

source: It starts with a conversation.
uz: Bu suhbatdan boshlanadi.

source: Are you an ambitious student or professional seeking a distinct advantage?
uz: Siz ajralib turadigan afzallik qidirayotgan ambitsiyali talaba yoki professionalmisiz?

source: A member of our team will show you how we can partner with you to help you launch and grow your professional network.
uz: Jamoamizning a'zosi sizga professional tarmog'ingizni ishga tushirish va o'shirishda qanday hamkorlik qilishimizni ko'rsatadi.

source: Get Started Today
uz: Bugun boshlang

source: Universities
uz: Universitetlar

source: Members to date
uz: Hozirgacha a'zolar

source: Countries
uz: Mamlakatlar

source: Success Rate
uz: Muvaffaqiyat darajasi
